<!-- dflook/terraform-github-actions {"workspace":"tvm-ci-prod","backend":"445d82b71d12ee4e384a7bedc36c9a2dcf0fec5014c62a996c64983cb8c6569a","backend_type":"s3"} -->
Terraform plan in __.__ in the __tvm-ci-prod__ workspace
With var files: `vars/tvm-ci-prod.auto.tfvars
`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.bucket-macos will be created
  + resource "aws_s3_bucket" "bucket-macos" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "tvm-sccache-macos-prod"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "tvm-sccache-macos-prod"
        }
      + tags_all                    = {
          + "Name" = "tvm-sccache-macos-prod"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.bucket-windows will be created
  + resource "aws_s3_bucket" "bucket-windows" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "tvm-sccache-windows-prod"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "tvm-sccache-windows-prod"
        }
      + tags_all                    = {
          + "Name" = "tvm-sccache-windows-prod"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform #117](https://github.com/tlc-pack/ci-terraform/actions/runs/2379884834)